fdivitto/FabGL/src/devdrivers/CH32V003.cpp
/**
 * Created by Olimex - <http://www.olimex.com>
 * Copyright (c) 2023 Olimex Ltd
 * All rights reserved.
 *
 *
 * Please contact info@olimex.com if you need a commercial license.
 *
 *
 * This library and related software is available under GPL v3.
 *
 * CH32V003 driver is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * CH32V003 driver is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with CH32V003 driver. If not, see <http://www.gnu.org/licenses/>.
 */

#include "CH32V003.h"
#include <string.h>

#ifdef CH32V003_DEBUG_ENABLED
	#define PROTOCOL_BYTE_DELAY()       (ets_delay_us(5000))
	#define PROTOCOL_MSG_DELAY()        (ets_delay_us(5000))
	
	#define PROTOCOL_SYNC_DELAY()       (ets_delay_us(10000))
#else
	#define PROTOCOL_BYTE_DELAY()
	#define PROTOCOL_MSG_DELAY()
	
	#define PROTOCOL_SYNC_DELAY()       (ets_delay_us(500))
#endif

// Delay for ADC measurement
static uint32_t ADC_Delay = 150;

// Delay for each byte when using I2C
// It is calculated at run time when I2C clock is set
static uint32_t I2C_Delay = 0;

// Delay for each byte when using SPI
// It is calculated at run time when SPI clock is set
static uint32_t SPI_Delay = 0;

// Delay for each byte when using UART
// It is calculated at run time when UART baudrate is set
static uint32_t UART_Delay = 0;
// ------------------------------------------- public -------------------------------------------

CH32V003::CH32V003 () :
	CH_MISO(GPIO_NUM_NC),
	CH_MOSI(GPIO_NUM_NC),
	CH_CLK(GPIO_NUM_NC),
	CH_CS(GPIO_NUM_NC),
	CH_SPIHost(HSPI_HOST),
	CH_SPIDevHandle(nullptr),
	spi_acquired(0),
	synced(false)
{
}

CH32V003::~CH32V003 ()
{
	end();
}

bool CH32V003::available()
{
	return CH_SPIDevHandle != nullptr && synced;
}

bool CH32V003::begin (gpio_num_t MISO, gpio_num_t MOSI, gpio_num_t CLK, gpio_num_t CS, int16_t CSActiveState, int16_t host)
{
	if (CSActiveState == -1)
		CSActiveState = 1;
	
	CH_MISO    = MISO;
	CH_MOSI    = MOSI;
	CH_CLK     = CLK;
	CH_CS      = CS;
	CH_SPIHost = (spi_host_device_t) host;
	
	spi_bus_config_t busconf = { }; // zero init
	busconf.mosi_io_num     = CH_MOSI;
	busconf.miso_io_num     = CH_MISO;
	busconf.sclk_io_num     = CH_CLK;
	busconf.quadwp_io_num   = -1;
	busconf.quadhd_io_num   = -1;
	busconf.flags           = SPICOMMON_BUSFLAG_MASTER;
	
	auto result = spi_bus_initialize(CH_SPIHost, &busconf, CH_DMACHANNEL);
	if (result == ESP_OK || result == ESP_ERR_INVALID_STATE) {
		// ESP_ERR_INVALID_STATE, maybe spi_bus_initialize already called
		spi_device_interface_config_t devconf = { };  // zero init
		devconf.mode           = 0;
		devconf.clock_speed_hz = CH_SPI_FREQ;
		devconf.spics_io_num   = CH_CS;
		devconf.flags          = (CSActiveState == 1 ? SPI_DEVICE_POSITIVE_CS : 0);
		devconf.queue_size     = 1;
		
		result = spi_bus_add_device(CH_SPIHost, &devconf, &CH_SPIDevHandle);
		if (result == ESP_OK) {
			sync();
			if (synced) version();
			return synced;
		}
	}
	
	end ();
	return false;
}

void CH32V003::end()
{
	synced = false;
	if (CH_SPIDevHandle) {
		spi_bus_remove_device(CH_SPIDevHandle);
		spi_bus_free(CH_SPIHost);
		CH_SPIDevHandle = nullptr;
	}
}

/**
 * Sample protocol message version
 * 
 * |  cmd      |  size       |  major     |  minor     |
 * |  version  |  0x02       |            |            |
 * |  10111101 |  00000010   |  00000001  |  00000000  |
 */
uint16_t CH32V003::version()
{
	if (firmware_ver != 0x0000) {
		return firmware_ver;
	}
	uint8_t spi_send[] = {0xBD, 0x02, 0, 0};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	uint8_t spi_receive[msg_size];
	transferProtocol (spi_send, spi_receive, msg_size);
	uint16_t ver = (spi_receive[2] << 8) |  spi_receive[3];
	if (ver == ((SYNC_RESPONSE << 8) | SYNC_RESPONSE)) {
		ver = 0x0009;
	}
	firmware_ver = ver;
	return firmware_ver;
}

void CH32V003::uextPowerEnable()
{
	setGPIO(GPIO_PORTC, GPIO_3, 0);
}

void CH32V003::uextPowerDisable()
{
	setGPIO(GPIO_PORTC, GPIO_3, 1);
}

// ------------------------------------------- GPIO -------------------------------------------

/**
 * Sample protocol message configure GPIO port
 * 
 * |  mode  cmd    dir  |  size       |  port      |  mask           |  dir               |  pullup      |
 * |  GPIO  init   out  |  0x04       |  PortA     |  Pin2 and Pin0  |  Pin2 in Pin0 out  |  no pullups  |
 * |  00    00001  0    |  00000100   |  00000001  |  00000101       |  00000100          |  00000000    |
 */
void CH32V003::configurePort(uint8_t port, uint8_t mask, uint8_t in_out, uint8_t pullup)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_PORT_INIT, DIRECTION_OUT), 0x04, port, mask, in_out, pullup};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	transferProtocol (spi_send, nullptr, msg_size);
}

/**
 * Sample protocol message set GPIO port
 * 
 * |  mode  cmd    dir  |  size       |  port      |  mask      |  value     |
 * |  GPIO  set    out  |  0x03       |  PortC     |  Pin2      |  1         |
 * |  00    00010  0    |  00000011   |  00000011  |  00000100  |  00000100  |
 */
void CH32V003::setPort (uint8_t port, uint8_t mask, uint8_t value)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_PORT_SET, DIRECTION_OUT), 0x03, port, mask, value};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	transferProtocol (spi_send, nullptr, msg_size);
}

/**
 * Sample protocol message get GPIO port
 * 
 * |  mode  cmd    dir  |  size       |  port      |  mask      |  value     |
 * |  GPIO  get    in   |  0x03       |  PortD     |  Pin2      |  0         |
 * |  00    00011  1    |  00000011   |  00000100  |  00000100  |  00000000  |
 */
uint8_t CH32V003::getPort(uint8_t port, uint8_t mask)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_PORT_GET, DIRECTION_IN), 0x03, port, mask};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
