fdivitto/FabGL/src/devdrivers/CH32V003.cpp
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	uint8_t data = transferByte(0x00);
	releaseSPI();
	
	return data;
}

void CH32V003::configureGPIO (uint8_t port, uint8_t gpio, uint8_t dir, uint8_t pullup)
{
	configurePort (port, 1<<gpio, dir<<gpio, pullup<<gpio);
}

void CH32V003::setGPIO (uint8_t port, uint8_t gpio, uint8_t value)
{
	setPort (port, 1<<gpio, value<<gpio);
}

uint8_t CH32V003::getGPIO (uint8_t port, uint8_t gpio)
{
	uint8_t data = getPort (port, 1<<gpio);
	return (data & (1<<gpio)) != 0;
}

/**
 * Sample protocol message Power Sense
 * 
 * |  mode  cmd    dir  |  size       |  data      |
 * |  GPIO  pwr    in   |  0x01       |            |
 * |  00    01001  1    |  00000001   |  00000000  |
 */
uint8_t CH32V003::powerSense ()
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_PWR_SENSE, DIRECTION_IN), 0x01};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	uint8_t data = transferByte(0x00);
	releaseSPI();
	
	return data;
}

/**
 * Sample protocol message Power Sense
 * 
 * |  mode  cmd    dir  |  size       |  data      |  data      |
 * |  GPIO  bat    in   |  0x02       |            |            |
 * |  00    01010  1    |  00000010   |  00000000  |  00000000  |
 */
uint16_t CH32V003::batterySense ()
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_BAT_SENSE, DIRECTION_IN), 0x02};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	ets_delay_us(ADC_Delay);
	uint16_t data = 0;
	for (uint8_t i=0; i<2; i++) {
		data = (data << 8) | transferByte(0x00);
	}
	releaseSPI();
	
	return data;
}

uint8_t CH32V003::batteryPercent (uint16_t bat_sense)
{
	uint16_t mV = (bat_sense != 0) ? bat_sense : batterySense();
	if (mV > BATTERY_MAX_MV)
		mV = BATTERY_MAX_MV;
	if (mV < BATTERY_MIN_MV)
		mV = BATTERY_MIN_MV;
	return (mV - BATTERY_MIN_MV) * 100 / (BATTERY_MAX_MV - BATTERY_MIN_MV);
}

/**
 * Sample protocol message set interrupt active
 * 
 * |  mode  cmd        dir  |  size       |  level     |
 * |  GPIO  int active out  |  0x01       |  high      |
 * |  00    10001      0    |  00000001   |  00000001  |
 */
void CH32V003::setIntActive(uint8_t level)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_INT_ACTIVE, DIRECTION_OUT), 0x01, level};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	transferProtocol (spi_send, nullptr, msg_size);
}

/**
 * Sample protocol message enable interrupt
 * 
 * |  mode  cmd        dir  |  size       |  port      |  pin      |  trigger   |
 * |  GPIO  int enable out  |  0x03       |  A         |  1         |  on change |
 * |  00    10010      0    |  00000011   |  00000001  |  00000001  |  00000011  |
 */
void CH32V003::enableInterrupt(uint8_t port, uint8_t pin, GPIO_INT_Trigger trigger)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_INT_ENABLE, DIRECTION_OUT), 0x03, port, pin, (uint8_t)trigger};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	transferProtocol (spi_send, nullptr, msg_size);
}

/**
 * Sample protocol message disable interrupt
 * 
 * |  mode  cmd         dir  |  size       |  port      |  pin       |
 * |  GPIO  int disable out  |  0x02       |  C         |  2         |
 * |  00    10011       0    |  00000010   |  00000011  |  00000010  |
 */
void CH32V003::disableInterrupt(uint8_t port, uint8_t pin)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_INT_DISABLE, DIRECTION_OUT), 0x02, port, pin};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	transferProtocol (spi_send, nullptr, msg_size);
}

/**
 * Sample protocol get interrupt flags (interrupt IS NOT cleared)
 * 
 * |  mode  cmd       dir |  size       |  port      |  data      |
 * |  GPIO  int flags in  |  0x02       |  D         |            |
 * |  00    10100     1   |  00000010   |  00000100  |  00000000  |
 */
uint8_t CH32V003::getPortIntFlags(uint8_t port)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_INT_FLAGS, DIRECTION_IN), 0x02, port, 0};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	uint8_t spi_receive[msg_size];
	transferProtocol (spi_send, spi_receive, msg_size);
	return spi_receive[msg_size-1];
}

/**
 * Sample protocol get interrupt capture (interrupt IS cleared)
 * 
 * |  mode  cmd       dir |  size       |  port      |  data      |
 * |  GPIO  int flags in  |  0x02       |  D         |            |
 * |  00    10101     1   |  00000010   |  00000100  |  00000000  |
 */
uint8_t CH32V003::getPortIntCaptured(uint8_t port)
{
	uint8_t spi_send[] = {protocolHeader(MODE_GPIO, CMD_INT_CAPTURE, DIRECTION_IN), 0x02, port, 0};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	uint8_t spi_receive[msg_size];
	transferProtocol (spi_send, spi_receive, msg_size);
	return spi_receive[msg_size-1];
}

// ------------------------------------------- I2C -------------------------------------------

/**
 * Sample protocol message configure I2C
 * 
 * |  mode  cmd    dir  |  size       |  clock MSB |         1048576         |  clock LSB |
 * |  I2C   init   out  |  0x04       |            |            |            |            |
 * |  01    00001  0    |  00000100   |  00000000  |  00010000  |  00000000  |  00000000  |
 */
void CH32V003::configureI2C (uint32_t clock)
{
	if (clock == 0) return;
	
	uint8_t spi_send[6] = {protocolHeader(MODE_I2C, CMD_I2C_INIT, DIRECTION_OUT), 0x04};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	for (int i=0; i<4; i++)	// byte 0 most significant BYTE, byte 3 least significant BYTE
		spi_send[i+2] = (clock>>((3-i)*8)) & 0xFF;
	transferProtocol (spi_send, nullptr, msg_size);
	
	// Microseconds needed for 1 byte to be transferred via I2C
	// approximate time (in microseconds) for sending 1 byte of data through I2C
	// Tbit = 1 000 000 / clock is the time for 1 bit of data
	// Tbyte = 8 * Tbit = 8 * 1 000 000 / clock
	// added 1 extra time for acknoledge bit + time for start and stop + some extra
	I2C_Delay = 12000000 / clock;
	if (version() < 0x0100)
		I2C_Delay += 150;	// 0.9v requires a little bit more delay between I2C bytes
}

/**
 * Sample protocol message write I2C
 * 
 * |  mode  cmd    dir  |  size       |  address   |  data 0 tx |  data 1 tx |  data 2 tx |
 * |  I2C   write  out  |  0x04       |  0x10      |            |            |            |
 * |  01    00010  0    |  00000100   |  00010000  |  00000000  |  00000000  |  00000000  |
 */
void CH32V003::writeI2C (uint8_t address, uint8_t buffer[], uint8_t size)
{
	uint8_t spi_send[size+3] = {protocolHeader(MODE_I2C, CMD_I2C_WRITE, DIRECTION_OUT), size+1, address};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	for (int i=0; i<size; i++)
		spi_send [i+3] = buffer[i];
	transferProtocol (spi_send, nullptr, msg_size);
	
	// Wait CH32V003 to transfer the data
	// total bytes sent = address byte + I2C_DELAY on CH32 (~1 byte time) + data bytes (size) + some extra
	ets_delay_us(I2C_Delay * (size + 4));
}

/**
 * Sample protocol message read I2C
 * 
 * |  mode  cmd    dir  |  size       |  address   |  data 0 rx |  data 1 rx |
 * |  I2C   read   in   |  0x03       |  0x10      |            |            |
 * |  01    00011  1    |  00000011   |  00010000  |  00000000  |  00000000  |
 */
void CH32V003::readI2C (uint8_t address, uint8_t buffer[], uint8_t size)
{
	uint8_t spi_send[] = {protocolHeader(MODE_I2C, CMD_I2C_READ, DIRECTION_IN), size+1, address};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
