fdivitto/FabGL/src/devdrivers/CH32V003.cpp
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	
	// Delay for each byte to allow I2C communication
	// total bytes = address + I2C_DELAY on CH32 + register + address + I2C_DELAY on CH32 + reading data (size) + some extra
	ets_delay_us(I2C_Delay * (size + 6));
	
	for (int i=0; i<size; i++) {
		buffer[i] = transferByte(0x00);
		PROTOCOL_BYTE_DELAY();
	}
	releaseSPI();
}

/**
 * Sample protocol message writeReg I2C
 * 
 * |  mode  cmd    dir  |  size       |  address   |  register  |  data tx   |
 * |  I2C   write  out  |  0x03       |  0x10      |  0x01      |            |
 * |  01    00010  0    |  00000011   |  00010000  |  00000001  |  00000000  |
 */
void CH32V003::writeRegI2C (uint8_t address, uint8_t reg, uint8_t value)
{
	uint8_t spi_send[] = {protocolHeader(MODE_I2C, CMD_I2C_WRITE, DIRECTION_OUT), 3, address, reg, value};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	transferProtocol (spi_send, nullptr, msg_size);
	
	// Wait CH32V003 to transfer the data
	// total bytes = address + I2C_DELAY on CH32 + register + value + some extra
	ets_delay_us(I2C_Delay * 6);
}

/**
 * Sample protocol message readReg I2C
 * 
 * |  mode  cmd    dir  |  size       |  address   |  register  |  data rx   |
 * |  I2C   read   in   |  0x03       |  0x10      |  0x01      |            |
 * |  01    00100  1    |  00000011   |  00010000  |  00000001  |  00000000  |
 */
uint8_t CH32V003::readRegI2C (uint8_t address, uint8_t reg)
{
	uint8_t spi_send[] = {protocolHeader(MODE_I2C, CMD_I2C_READREG, DIRECTION_IN), 3, address, reg};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	
	// Delay to allow I2C communication
	// total bytes = writeI2C(1 byte) 1+4 + readI2C(1 byte) 1+6
	ets_delay_us(I2C_Delay * 15);
	
	uint8_t data = transferByte(0x00);
	ets_delay_us(I2C_Delay);
	
	releaseSPI();
	
	return data;
}

// ------------------------------------------- SPI -------------------------------------------

/**
 * Sample protocol message configure SPI
 * 
 * |  mode  cmd    dir  |  size       |  spi mode   |  clock MSB |         1048576         |  clock LSB |
 * |  SPI   init   out  |  0x05       |  0x03       |            |            |            |            |
 * |  10    00001  0    |  00000101   |  00000011   |  00000000  |  00010000  |  00000000  |  00000000  |
 */
void CH32V003::configureSPI (uint8_t spi_mode, uint32_t clock)
{
	if (clock == 0) return;
	
	uint8_t spi_send[] = {protocolHeader(MODE_SPI, CMD_SPI_INIT, DIRECTION_OUT), 0x05, spi_mode, 0, 0, 0, 0};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	for (int i=0; i<4; i++)	// byte 0 most significant BYTE, byte 3 least significant BYTE
		spi_send[i+3] = (clock>>((3-i)*8)) & 0xFF;
	
	transferProtocol (spi_send, nullptr, msg_size);
	
	uint32_t t = 1000000 / clock;	// time for bit [us]
	if (t < 20) {
		t = 20;
	}
	// 8 bits * (time for bit + time for edges + time for calculating the data)
	SPI_Delay = 8 * (t + 30 + 20);
}

/**
 * Sample protocol message transfer8 SPI
 * 
 * |  mode  cmd        dir  |  size       |  data 0 tx |  data 1 tx |  data 2 tx |            |
 * |  SPI   transfer8  out  |  0x04       |            |            |            |            |
 * |  10    00010      0    |  000000!0   |  00000000  |  00000000  |  00000000  |  00000000  |
 * |                        |             |            |  data 0 rx |  data 1 rx |  data 2 rx |
 */
void CH32V003::transferSPI8 (uint8_t tx_buffer[], uint8_t rx_buffer[], const uint8_t size)
{
	uint8_t spi_send[] = {protocolHeader(MODE_SPI, CMD_SPI_TRANSFER8, DIRECTION_OUT), size+1};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	
	uint8_t response;
	for (int i=0; i<=size; i++) {
		response = (i < size) ? 
			transferByte(tx_buffer[i]) 
			: 
			transferByte(0)
		;
		
		if (i > 0) {
			rx_buffer[i-1] = response;
		}
		ets_delay_us(SPI_Delay);
	}
	releaseSPI();
}

/**
 * Sample protocol message transfer16 SPI
 * 
 * |  mode  cmd        dir  |  size       |  data 0 tx |  data 0 tx |  data 1 tx |  data 1 tx |            |            |
 * |  SPI   transfer16 out  |  0x06       |  0x00      |            |            |            |            |            |
 * |  10    00011      0    |  00000110   |  00000000  |  00000000  |  00000000  |  00000000  |  00000000  |  00000000  |
 * |                        |             |            |            |  data 0 rx |  data 0 rx |  data 1 rx |  data 1 rx |
 */
void CH32V003::transferSPI16 (uint16_t tx_buffer[], uint16_t rx_buffer[], const uint8_t size)
{
	uint8_t spi_send[] = {protocolHeader(MODE_SPI, CMD_SPI_TRANSFER16, DIRECTION_OUT), size*2+2};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	
	uint16_t response;
	for (int i=0; i<=size; i++) {
		response = (i < size) ? 
			transferWord(tx_buffer[i]) 
			: 
			transferWord(0)
		;
		
		if (i > 0) {
			rx_buffer[i-1] = response;
		}
		ets_delay_us(SPI_Delay * 2);
	}
	releaseSPI();
}

// ------------------------------------------- UART -------------------------------------------

/**
 * Sample protocol message configure UART
 * 
 * |  mode  cmd    dir  |  size       |  baud MSB  |         115200          |  baud LSB  |  stop_bits |  parity    |
 * |  UART  init   out  |  0x06       |            |            |            |            |            |            |
 * |  11    00001  0    |  00000110   |  00000000  |  00000001  |  11000010  |  00000000  |  00000001  |  00000000  |
 */
void CH32V003::configureUART (uint32_t baudrate, UART_StopBits stop_bits, UART_Parity parity)
{
	uint8_t spi_send[] = {protocolHeader(MODE_UART, CMD_UART_CONFIGURE, DIRECTION_OUT), 6, 0, 0, 0, 0, (uint8_t)stop_bits, (uint8_t)parity};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
