fdivitto/FabGL/src/devdrivers/CH32V003.cpp
	for (uint8_t i=0; i<4; i++)
	{
		spi_send[i+2] = (baudrate >> ((3-i)*8)) & 0xFF;
	}
	
	transferProtocol (spi_send, nullptr, msg_size);
	
	// Time for 1 bit of data (in microseconds) = 1000000 / baudrate [us/bits]
	// Delay (in us) for the whole byte = (start bit + 8 data bits + stop bit(s) + parity) * time for 1 bit [us]
	UART_Delay = (1000000 / baudrate) * 10;
}

/**
 * Sample protocol message write UART
 * 
 * |  mode  cmd    dir  |  size       |  data 0 tx |  data 1 tx |  data 2 tx |  data 3 tx |
 * |  UART  write  out  |  0x04       |            |            |            |            |
 * |  11    00010  0    |  00000100   |  00000000  |  00000000  |  00000000  |  00000000  |
 */
void CH32V003::writeUART (uint8_t buff[], uint8_t size)
{
	uint8_t spi_send[size+2] = {protocolHeader(MODE_UART, CMD_UART_WRITE, DIRECTION_OUT), size};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	for (int i=0; i<size; i++)
		spi_send [i+2] = buff[i];
	transferProtocol (spi_send, nullptr, msg_size);
	
	// Wait CH32V003 to transfer the data
	ets_delay_us(UART_Delay * size);
}

void CH32V003::strWriteUART(char message[])
{
	uint8_t len = strlen(message);
	if (len) {
		writeUART((uint8_t *)message, len);
	}
}


/**
 * Sample protocol message reaad UART
 * 
 * |  mode  cmd    dir  |  size       |  received  |  data 0 rx |  data 1 rx |  data 2 rx |  no data   |  no data   |  no data   |
 * |  UART  raad   in   |  0x06       |            |            |            |            |            |            |            |
 * |  11    00011  1    |  00000110   |  00000011  |  00000000  |  00000000  |  00000000  |  --------  |  --------  |  --------  |
 */
uint8_t CH32V003::readUART (uint8_t buff[], uint8_t size)
{
	uint8_t spi_send[] = {protocolHeader(MODE_UART, CMD_UART_READ, DIRECTION_IN), size+1};
	const int msg_size = sizeof(spi_send)/sizeof(uint8_t);
	
	acquireSPI();
	transferProtocol (spi_send, nullptr, msg_size);
	
	uint8_t received = transferByte(0x00);
	PROTOCOL_BYTE_DELAY ();
	
	for (int i=0; i<received; i++) {
		buff[i] = transferByte(0x00);
		PROTOCOL_BYTE_DELAY ();
	}
	releaseSPI();
	
	return received;
}

// UEXT
void CH32V003::initUEXT ()
{
	uextPowerEnable();
	// Clear IO_EXP_IRQ
	getPortIntCaptured(GPIO_PORTA);
	getPortIntCaptured(GPIO_PORTC);
	getPortIntCaptured(GPIO_PORTD);
}

void CH32V003::configureUEXT (uint8_t gpio, uint8_t dir, uint8_t pullup)
{
	uint8_t port, portGPIO;
	uext2port(gpio, &port, &portGPIO);
	configureGPIO(port, portGPIO, dir, pullup);
}

void CH32V003::enableUEXTInterrupt (uint8_t gpio, GPIO_INT_Trigger trigger)
{
	uint8_t port, portGPIO;
	uext2port(gpio, &port, &portGPIO);
	enableInterrupt(port, portGPIO, trigger);
}

void CH32V003::disableUEXTInterrupt (uint8_t gpio)
{
	uint8_t port, portGPIO;
	uext2port(gpio, &port, &portGPIO);
	disableInterrupt(port, portGPIO);
}

uint8_t CH32V003::getUEXTIntFlags() 
{
	uint8_t flags = 0;
	
	uint8_t flagsA = getPortIntFlags(GPIO_PORTA);
	uint8_t flagsC = getPortIntFlags(GPIO_PORTC);
	uint8_t flagsD = getPortIntFlags(GPIO_PORTD);
	
	flags |= ((flagsD & (1 << 5)) != 0) << 0; // D5 - gpio 0 - pin 3
	flags |= ((flagsD & (1 << 6)) != 0) << 1; // D6 - gpio 1 - pin 4
	flags |= ((flagsC & (1 << 2)) != 0) << 2; // C2 - gpio 2 - pin 5
	flags |= ((flagsC & (1 << 1)) != 0) << 3; // C1 - gpio 3 - pin 6
	flags |= ((flagsA & (1 << 2)) != 0) << 4; // A2 - gpio 4 - pin 7
	flags |= ((flagsA & (1 << 1)) != 0) << 5; // A1 - gpio 5 - pin 8
	flags |= ((flagsD & (1 << 4)) != 0) << 6; // D4 - gpio 6 - pin 9
	flags |= ((flagsD & (1 << 3)) != 0) << 7; // D3 - gpio 7 - pin 10
	
	return flags;
}

uint8_t CH32V003::getUEXTIntCaptured()
{
	uint8_t capture = 0;
	
	uint8_t captureA = getPortIntCaptured(GPIO_PORTA);
	uint8_t captureC = getPortIntCaptured(GPIO_PORTC);
	uint8_t captureD = getPortIntCaptured(GPIO_PORTD);
	
	capture |= ((captureD & (1 << 5)) != 0) << 0; // D5 - gpio 0 - pin 3
	capture |= ((captureD & (1 << 6)) != 0) << 1; // D6 - gpio 1 - pin 4
	capture |= ((captureC & (1 << 2)) != 0) << 2; // C2 - gpio 2 - pin 5
	capture |= ((captureC & (1 << 1)) != 0) << 3; // C1 - gpio 3 - pin 6
	capture |= ((captureA & (1 << 2)) != 0) << 4; // A2 - gpio 4 - pin 7
	capture |= ((captureA & (1 << 1)) != 0) << 5; // A1 - gpio 5 - pin 8
	capture |= ((captureD & (1 << 4)) != 0) << 6; // D4 - gpio 6 - pin 9
	capture |= ((captureD & (1 << 3)) != 0) << 7; // D3 - gpio 7 - pin 10
	
	return capture;
}

uint8_t CH32V003::readUEXT (uint8_t gpio)
{
	uint8_t port, portGPIO;
	uext2port(gpio, &port, &portGPIO);
	return getGPIO (port, portGPIO);
}

void CH32V003::writeUEXT (uint8_t gpio, uint8_t value)
{
	uint8_t port, portGPIO;
	uext2port(gpio, &port, &portGPIO);
	return setGPIO (port, portGPIO, value);
}

// ------------------------------------------- private -------------------------------------------

void CH32V003::uext2port(uint8_t uextGPIO, uint8_t *port, uint8_t *portGPIO)
{
	switch (uextGPIO) {
		case 0: // pin 3
			*port     = GPIO_PORTD;
			*portGPIO = GPIO_5;
		break;
		
		case 1: // pin 4
			*port     = GPIO_PORTD;
			*portGPIO = GPIO_6;
		break;
		
		case 2: // pin 5
			*port     = GPIO_PORTC;
			*portGPIO = GPIO_2;
		break;
		
		case 3: // pin 6
			*port     = GPIO_PORTC;
			*portGPIO = GPIO_1;
		break;
		
		case 4: // pin 7
			*port     = GPIO_PORTA;
			*portGPIO = GPIO_2;
		break;
		
		case 5: // pin 8
			*port     = GPIO_PORTA;
			*portGPIO = GPIO_1;
		break;
		
		case 6: // pin 9
			*port     = GPIO_PORTD;
			*portGPIO = GPIO_4;
		break;
		
		case 7: // pin 10
			*port     = GPIO_PORTD;
			*portGPIO = GPIO_3;
		break;
	}
}

void CH32V003::acquireSPI()
{
	if (CH_SPIDevHandle == nullptr) {
		LOG_DEBUG("CH32V003 not available or not started" EOL);
		return;
	}
	
	if (spi_acquired == 0) {
		spi_device_acquire_bus(CH_SPIDevHandle, portMAX_DELAY);
	}
	
	spi_acquired++;
}

