fdivitto/FabGL/src/devdrivers/CH32V003.cpp
void CH32V003::releaseSPI()
{
	if (CH_SPIDevHandle == nullptr) {
		LOG_DEBUG("CH32V003 not available or not started" EOL);
		return;
	}
	
	if (spi_acquired > 0) {
		spi_acquired--;
	}
	
	if (spi_acquired == 0) {
		spi_device_release_bus(CH_SPIDevHandle);
	}
}

uint8_t CH32V003::protocolHeader (uint8_t mode, uint8_t command, uint8_t direction)
{
	return ((mode&0x3)<<6) | ((command&0x1F)<<1) | (direction & 0x01);
}

uint8_t CH32V003::transferByte (uint8_t send)
{
	if (CH_SPIDevHandle == nullptr) {
		LOG_DEBUG("CH32V003 not available or not started" EOL);
		return 0x00;
	}
	
	uint8_t txdata[1] = { send };
	uint8_t rxdata[1];
	spi_transaction_t ta;
	ta.flags      = 0;
	ta.length     = 8;
	ta.rxlength   = 8;
	ta.rx_buffer  = rxdata;
	ta.tx_buffer  = txdata;
	spi_device_transmit(CH_SPIDevHandle, &ta);

	return rxdata[0];
}

uint16_t CH32V003::transferWord (uint16_t send)
{
	uint16_t rx = transferByte(send >> 8) << 8;
	PROTOCOL_BYTE_DELAY();
	
	rx |= transferByte(send & 0xFF);
	PROTOCOL_BYTE_DELAY();
	
	return rx;
}


void CH32V003::transferProtocol(uint8_t txdata[], uint8_t rxdata[], uint16_t size)
{
	bool sync_detect;
	
	if (CH_SPIDevHandle == nullptr) {
		if (rxdata != nullptr) {
			for (int i=0; i<size; i++) {
				rxdata[i] = 0;
			}
		}
		LOG_DEBUG("CH32V003 not available or not started" EOL);
		return;
	}
	
	acquireSPI();
	do {
		sync_detect = false;
		for (int i=0; i<size; i++) {
			uint8_t rxbyte;
			// LOG_DEBUG("Sending 0x%02X" EOL, txdata[i]);
			rxbyte = transferByte (txdata[i]);
			if (i <= 1 && rxbyte == SYNC_RESPONSE) {
				LOG_DEBUG("CH32V003 is waiting for sync sequence" EOL);
				sync_detect = true;
				break;
			}
			if (rxdata != nullptr) {
				rxdata[i] = rxbyte;
				// LOG_DEBUG("Received 0x%02X" EOL, rxbyte);
			}
			PROTOCOL_BYTE_DELAY();
		}
		PROTOCOL_MSG_DELAY();
		
		if (sync_detect) sync();
	} while (sync_detect);
	releaseSPI();
}

void CH32V003::sync() {
	if (CH_SPIDevHandle == nullptr) {
		LOG_DEBUG("CH32V003 not available or not started" EOL);
		return;
	}
	
	bool timeout = false;
	uint8_t response = 0x00;
	int64_t t1 = esp_timer_get_time();
	
	LOG_DEBUG("SYNC initiated..." EOL);
	acquireSPI();
	do {
		response = transferByte(SYNC_MAGIC);
		PROTOCOL_SYNC_DELAY();
		LOG_DEBUG("sync 0x%02X" EOL, response);
		if (esp_timer_get_time() - t1 > SYNC_TIMEOUT) {
			timeout = true;
			break;
		}
	} while (response != SYNC_RESPONSE);
	releaseSPI();
	
	if (timeout) {
		LOG_DEBUG("SYNC timeout." EOL);
	} else {
		LOG_DEBUG("SYNC done." EOL);
		synced = true;
	}
}
